import random

answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом', 'Мне кажется - да',
 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да', 'Пока неясно', 'попробуй снова', 'Спроси позже', 
 'Лучше не рассказывать', 'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 
 'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name = str(input('Введите Ваше имя: '))
print('Привет', name)

def ask_questions():
    while True:
        question = input('Введите Ваш вопрос: ')
        answer = random.choice(answers)
        print(answer)
        choice = str(input('Хотите задать еще один вопрос? (y = yes, n = no): '))
        if choice == 'y':
            continue
        else:
            print('Возвращайся если возникнут вопросы!')
            break
ask_questions()